### More on DATA FRAMES:

In [2]:
import pandas as pd
import numpy as np

In [2]:
pd.read_csv("data/employees.csv")

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

In [3]:
employees = pd.read_csv("data/employees.csv")

In [4]:
employees[employees["Mgmt"] == True]

    First Name  Gender Start Date    Salary  Mgmt         Team
0      Douglas    Male     8/6/93       NaN  True    Marketing
1       Thomas    Male    3/31/96   61933.0  True          NaN
3        Jerry     NaN     3/4/05  138705.0  True      Finance
4        Larry    Male    1/24/98  101004.0  True           IT
6         Ruby  Female    8/17/87   65476.0  True      Product
..         ...     ...        ...       ...   ...          ...
991       Rose  Female    8/25/02  134505.0  True    Marketing
992    Anthony    Male   10/16/11  112769.0  True      Finance
993       Tina  Female    5/15/97   56450.0  True  Engineering
994     George    Male    6/21/13   98874.0  True    Marketing
999     Albert    Male    5/15/12  129949.0  True        Sales

[468 rows x 6 columns]

In [5]:
finance = employees["Team"] == "Finance"
employees[finance]

    First Name  Gender Start Date    Salary   Mgmt     Team
2        Maria  Female        NaN  130590.0  False  Finance
3        Jerry     NaN     3/4/05  138705.0   True  Finance
7          NaN  Female    7/20/15   45906.0    NaN  Finance
14    Kimberly  Female    1/14/99   41426.0   True  Finance
46       Bruce    Male   11/28/09  114796.0  False  Finance
..         ...     ...        ...       ...    ...      ...
907  Elizabeth  Female    7/27/98  137144.0  False  Finance
954        Joe    Male    1/19/80  119667.0   True  Finance
987     Gloria  Female    12/8/14  136709.0   True  Finance
992    Anthony    Male   10/16/11  112769.0   True  Finance
996    Phillip    Male    1/31/84   42392.0  False  Finance

[102 rows x 6 columns]

In [10]:
greater_than_10k = employees["Salary"] > 100000
employees[greater_than_10k]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
9      Frances  Female     8/8/02  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
990      Robin  Female    7/24/87  100765.0   True            IT
991       Rose  Female    8/25/02  134505.0   True     Marketing
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
999     Albert    Male    5/15/12  129949.0   True         Sales

[409 rows x 6 columns]

### Data Extracting:

In [11]:
is_female = employees["Gender"] == "Female"
is_biz_dev = employees["Team"] == "Business Dev"
is_manager = employees["Mgmt"]  # you need not mention "== True", as it is boolean.

In [14]:
employees[is_female & is_biz_dev & is_manager].head(5)

    First Name  Gender Start Date    Salary  Mgmt          Team
9      Frances  Female     8/8/02  139852.0  True  Business Dev
38   Stephanie  Female    9/13/86   36844.0  True  Business Dev
66       Nancy  Female   12/15/12  125250.0  True  Business Dev
92       Linda  Female    5/25/00  119009.0  True  Business Dev
111     Bonnie  Female   12/17/99   42153.0  True  Business Dev

### isin() nethod:

In [15]:
star_teams = ["Legal", "Sales", "Marketing"]
all_star_teams = employees["Team"].isin(star_teams)
employees[all_star_teams]

    First Name  Gender Start Date    Salary   Mgmt       Team
0      Douglas    Male     8/6/93       NaN   True  Marketing
5       Dennis    Male    4/18/87  115163.0  False      Legal
11       Julie  Female   10/26/97  102508.0   True      Legal
13        Gary    Male    1/27/08  109831.0  False      Sales
20        Lois     NaN    4/22/95   64714.0   True      Legal
..         ...     ...        ...       ...    ...        ...
986      Donna  Female   11/26/82   82871.0  False  Marketing
989     Justin     NaN    2/10/91   38344.0  False      Legal
991       Rose  Female    8/25/02  134505.0   True  Marketing
994     George    Male    6/21/13   98874.0   True  Marketing
999     Albert    Male    5/15/12  129949.0   True      Sales

[280 rows x 6 columns]

In [19]:
salary_80k_90k = employees["Salary"].between(80000,90000)

In [31]:
employees[salary_80k_90k]

    First Name  Gender Start Date   Salary   Mgmt         Team
19       Donna  Female    7/22/10  81014.0  False      Product
31       Joyce     NaN    2/20/05  88657.0  False      Product
35     Theresa  Female   10/10/06  85182.0  False        Sales
45       Roger    Male    4/17/80  88010.0   True        Sales
54        Sara  Female    8/15/07  83677.0  False  Engineering
..         ...     ...        ...      ...    ...          ...
930      Nancy  Female    9/10/01  85213.0   True    Marketing
956    Beverly  Female   10/17/86  80838.0  False  Engineering
963        Ann  Female    9/23/94  89443.0   True        Sales
985    Stephen     NaN    7/10/83  85668.0  False        Legal
986      Donna  Female   11/26/82  82871.0  False    Marketing

[94 rows x 6 columns]

In [45]:
between_80_90 = employees["Start Date"].between(
    left="1980-01-01",
    right="1990-01-01"
)
employees[between_80_90]

    First Name  Gender Start Date    Salary   Mgmt         Team
5       Dennis    Male 1987-04-18  115163.0  False        Legal
6         Ruby  Female 1987-08-17   65476.0   True      Product
10      Louise  Female 1980-08-12   63241.0   True          NaN
12     Brandon    Male 1980-12-01  112807.0   True           HR
17       Shawn    Male 1986-12-07  111737.0  False      Product
..         ...     ...        ...       ...    ...          ...
983       John    Male 1982-12-23  146907.0  False  Engineering
985    Stephen     NaN 1983-07-10   85668.0  False        Legal
986      Donna  Female 1982-11-26   82871.0  False    Marketing
990      Robin  Female 1987-07-24  100765.0   True           IT
996    Phillip    Male 1984-01-31   42392.0  False      Finance

[240 rows x 6 columns]

In [44]:
employees["Start Date"].dtype

dtype('<M8[ns]')

In [ ]:
#convert start date to datetime
employees["Start Date"] = pd.to_datetime(employees["Start Date"])

### isnull() ---- Identifies null values in column

In [46]:
employees["First Name"].isnull()
employees[employees["First Name"].isnull()]

     First Name  Gender Start Date    Salary Mgmt          Team
7           NaN  Female 2015-07-20   45906.0  NaN       Finance
23          NaN    Male 2012-06-14  125792.0  NaN           NaN
25          NaN    Male 2012-10-08   37076.0  NaN            IT
32          NaN    Male 1998-08-21  122340.0  NaN           NaN
39          NaN    Male 2016-01-29  122173.0  NaN            IT
...         ...     ...        ...       ...  ...           ...
925         NaN  Female 2000-08-23   95866.0  NaN         Sales
946         NaN  Female 1985-09-15  133472.0  NaN  Distribution
947         NaN    Male 2012-07-30  107351.0  NaN     Marketing
951         NaN  Female 2010-09-14  143638.0  NaN           NaN
1000        NaN     NaN        NaT       NaN  NaN           NaN

[68 rows x 6 columns]

In [47]:
employees["Mgmt"].isnull()
employees[employees["Mgmt"].isnull()]

     First Name  Gender Start Date    Salary Mgmt          Team
7           NaN  Female 2015-07-20   45906.0  NaN       Finance
23          NaN    Male 2012-06-14  125792.0  NaN           NaN
25          NaN    Male 2012-10-08   37076.0  NaN            IT
32          NaN    Male 1998-08-21  122340.0  NaN           NaN
39          NaN    Male 2016-01-29  122173.0  NaN            IT
...         ...     ...        ...       ...  ...           ...
925         NaN  Female 2000-08-23   95866.0  NaN         Sales
946         NaN  Female 1985-09-15  133472.0  NaN  Distribution
947         NaN    Male 2012-07-30  107351.0  NaN     Marketing
951         NaN  Female 2010-09-14  143638.0  NaN           NaN
1000        NaN     NaN        NaT       NaN  NaN           NaN

[68 rows x 6 columns]

In [48]:
# so here by the data, we undestrand the nulls in First Name are nulls in Mgmt column as well.

### dropna() ---- Drops rows with null values in specified columnm

In [ ]:
employees.dropna() # drop all the row missing values

    First Name  Gender Start Date    Salary   Mgmt          Team
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
6         Ruby  Female 1987-08-17   65476.0   True       Product
8       Angela  Female 2005-11-22   95570.0   True   Engineering
9      Frances  Female 2002-08-08  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
994     George    Male 2013-06-21   98874.0   True     Marketing
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[761 rows x 6 columns]

In [50]:
employees.dropna(how= "any")   # if atleast one null value in a row, such rows will be dropped.

    First Name  Gender Start Date    Salary   Mgmt          Team
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
6         Ruby  Female 1987-08-17   65476.0   True       Product
8       Angela  Female 2005-11-22   95570.0   True   Engineering
9      Frances  Female 2002-08-08  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
994     George    Male 2013-06-21   98874.0   True     Marketing
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[761 rows x 6 columns]

In [51]:
employees.dropna(how = "all")  # only if all values in a row are null, such rows will be dropped.

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[1000 rows x 6 columns]

In [59]:
employees.dropna(subset=["Gender"])  # drop rows where Gender is null.

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       0.0   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
5       Dennis    Male 1987-04-18  115163.0  False         Legal
..         ...     ...        ...       ...    ...           ...
994     George    Male 2013-06-21   98874.0   True     Marketing
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[854 rows x 6 columns]

In [61]:
# change salary datatype from float to integer
employees["Salary"] = employees["Salary"].astype("Int64")

In [64]:
employees.dropna(subset=["Gender", "First Name"])  # drop rows where Gender and First name is null.

    First Name  Gender Start Date  Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       0   True     Marketing
1       Thomas    Male 1996-03-31   61933   True           NaN
2        Maria  Female        NaT  130590  False       Finance
4        Larry    Male 1998-01-24  101004   True            IT
5       Dennis    Male 1987-04-18  115163  False         Legal
..         ...     ...        ...     ...    ...           ...
994     George    Male 2013-06-21   98874   True     Marketing
996    Phillip    Male 1984-01-31   42392  False       Finance
997    Russell    Male 2013-05-20   96914  False       Product
998      Larry    Male 2013-04-20   60500  False  Business Dev
999     Albert    Male 2012-05-15  129949   True         Sales

[794 rows x 6 columns]

### thresh specifies non - missing values to keep a row from deleting

In [66]:
employees.dropna(thresh= 4) # drop rows which have less than 4 non null values.

    First Name  Gender Start Date  Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       0   True     Marketing
1       Thomas    Male 1996-03-31   61933   True           NaN
2        Maria  Female        NaT  130590  False       Finance
3        Jerry     NaN 2005-03-04  138705   True       Finance
4        Larry    Male 1998-01-24  101004   True            IT
..         ...     ...        ...     ...    ...           ...
995      Henry     NaN 2014-11-23  132483  False  Distribution
996    Phillip    Male 1984-01-31   42392  False       Finance
997    Russell    Male 2013-05-20   96914  False       Product
998      Larry    Male 2013-04-20   60500  False  Business Dev
999     Albert    Male 2012-05-15  129949   True         Sales

[985 rows x 6 columns]

### Inversion Operator: (~)
#### Inversion operator (~) helps to select non null values in a column and filter the dataframe based on that and convert the True to False and vice versa.

### Duplicated()

In [68]:
employees["Team"].head(15).duplicated()   # check for duplicated values in Team column for first 15 rows.

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7      True
8     False
9     False
10     True
11     True
12    False
13    False
14     True
Name: Team, dtype: bool

In [70]:
employees["Team"].duplicated(keep= "first")  # mark duplicates as True except for first occurrence.

0       False
1       False
2       False
3        True
4       False
        ...
996      True
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool

In [75]:
employees["Team"].duplicated(keep= "last")  # mark duplicates as True except for the last occurrence.

0        True
1        True
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Team, Length: 1001, dtype: bool